Revit 2024 API
AssetPropertyList.InsertNewAssetPropertyDouble Method
 Inserts a new AssetPropertyDouble containing the input value to this list.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018.1
Syntax
C#
public void InsertNewAssetPropertyDouble(
	double value,
	int index
)
Visual Basic
Public Sub InsertNewAssetPropertyDouble ( _
	value As Double, _
	index As Integer _
)
Visual C++
public:
void InsertNewAssetPropertyDouble(
	double value,
	int index
)
Parameters
value
Type: System.Double
 The double value to insert.
index
Type: System.Int32
 An integer index.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  index is out of range.
Autodesk.Revit.Exceptions.InvalidOperationException |  The asset property is not editable.
See Also
AssetPropertyList Class
Autodesk.Revit.DB.Visual Namespace